ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
/*

Copyright (c) 2010 - 2022, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7140_GRAPHICS_PERIPHERALS_H
#define NRF7140_GRAPHICS_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

/*AUXPLL*/
#define AUXPLL_PRESENT
#define AUXPLL_COUNT 2

/*HSFLL*/
#define HSFLL_PRESENT
#define HSFLL_COUNT 1

#define HSFLL_DITHER_32B 1

/*LRCCONF*/
#define LRCCONF_PRESENT
#define LRCCONF_COUNT 2

#define LRCCONF0_POWERON 1
#define LRCCONF0_RETAIN 1
#define LRCCONF0_OTHERON 0
#define LRCCONF0_AX2XWAITSTATES 0
#define LRCCONF0_SYSTEMOFF 1
#define LRCCONF0_PDACT 1
#define LRCCONF0_CLKCTRL 0
#define LRCCONF0_LRCREQHFXO 1

#define LRCCONF1_POWERON 1
#define LRCCONF1_RETAIN 1
#define LRCCONF1_OTHERON 0
#define LRCCONF1_AX2XWAITSTATES 0
#define LRCCONF1_SYSTEMOFF 1
#define LRCCONF1_PDACT 1
#define LRCCONF1_CLKCTRL 0
#define LRCCONF1_LRCREQHFXO 1

/*PCGC Master*/
#define PCGCMASTER_PRESENT
#define PCGCMASTER_COUNT 2

#define PCGCM0_POWERCONSUMPTIONCALC 1
#define PCGCM0_SETPWRCONTHRESHOLDBASE 1
#define PCGCM0_CLOCKFORCEREG 1
#define PCGCM0_MASTERFORCEREG 1

#define PCGCM1_POWERCONSUMPTIONCALC 1
#define PCGCM1_SETPWRCONTHRESHOLDBASE 1
#define PCGCM1_CLOCKFORCEREG 1
#define PCGCM1_MASTERFORCEREG 1

/*System protection unit*/
#define SPU_PRESENT
#define SPU_COUNT 1

#define SPU000_GRTCSECONDARYOFFSET 0
#define SPU000_BELLS 0
#define SPU000_IPCT 0
#define SPU000_DPPI 0
#define SPU000_GPIOTE 0
#define SPU000_GRTC 0
#define SPU000_GPIO 0
#define SPU000_MRAMC 0
#define SPU000_COEXC 0
#define SPU000_ANTSWC 0

/*Memory configuration*/
#define MEMCONF_PRESENT
#define MEMCONF_COUNT 1

#define MEMCONF_RETTRIM 1
#define MEMCONF_REPAIR 0
#define MEMCONF_POWER 1

/*PCGCSlave*/
#define PCGCSLAVE_PRESENT
#define PCGCSLAVE_COUNT 1

#define PCGCS_PENALTYTASKS 0

/*Factory Information Configuration Registers*/
#define FICR_PRESENT
#define FICR_COUNT 1

#define FICR_LTE_ON 0
#define FICR_WIFI_ON 1
#define FICR_NFC_ON 1

/*USBHSCORE*/
#define USBHSCORE_PRESENT
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT
#define I3CCORE_COUNT 2

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT
#define STMDATA_COUNT 1

/*TDDCONF*/
#define TDDCONF_PRESENT
#define TDDCONF_COUNT 1

#define TDDCONF_FEATEN_TDDCONF_CLK_320MHZ 1
#define TDDCONF_FEATEN_TDDCONF_CLK_400MHZ 0

/*GENERIC*/
#define GENERIC_PRESENT
#define GENERIC_COUNT 3

/*System Trace Macrocell*/
#define STM_PRESENT
#define STM_COUNT 1

/*Trace Port Interface Unit*/
#define TPIU_PRESENT
#define TPIU_COUNT 1

/*Cross-Trigger Interface control. NOTE: this is not a separate peripheral, but describes CM33 functionality.*/
#define CTI_PRESENT
#define CTI_COUNT 2

/*ATB Replicator module*/
#define ATBREPLICATOR_PRESENT
#define ATBREPLICATOR_COUNT 4

/*ATB funnel module*/
#define ATBFUNNEL_PRESENT
#define ATBFUNNEL_COUNT 4

/*GPIO Tasks and Events*/
#define GPIOTE_PRESENT
#define GPIOTE_COUNT 1

/*Global Real-time counter*/
#define GRTC_PRESENT
#define GRTC_COUNT 1

#define GRTC_MSBWIDTH 15
#define GRTC_NCC 24
#define GRTC_NTIMEOUT 16
#define GRTC_NDOMAIN 16
#define GRTC_GRTC_NINTERRUPTS 3
#define GRTC_PWMREGS 1
#define GRTC_CLKOUTREG 1

/*Trace buffer monitor*/
#define TBM_PRESENT
#define TBM_COUNT 1

/*USBHS*/
#define USBHS_PRESENT
#define USBHS_COUNT 1

/*MRAM controller*/
#define MRAMC_PRESENT
#define MRAMC_COUNT 2

#define MRAMC110_NVRPAGEACC 1

#define MRAMC111_NVRPAGEACC 0

/*External Memory Interface*/
#define EXMIF_PRESENT
#define EXMIF_COUNT 1

/*Quad serial peripheral interface*/
#define QSPI_PRESENT
#define QSPI_COUNT 2

/*Distributed programmable peripheral interconnect controller*/
#define DPPIC_PRESENT
#define DPPIC_COUNT 9

#define DPPIC110_HASCHANNELGROUPS 1
#define DPPIC110_CH_NUM 8
#define DPPIC110_GROUP_NUM 2

#define DPPIC120_HASCHANNELGROUPS 1
#define DPPIC120_CH_NUM 8
#define DPPIC120_GROUP_NUM 2

#define DPPIC130_HASCHANNELGROUPS 1
#define DPPIC130_CH_NUM 8
#define DPPIC130_GROUP_NUM 2

#define DPPIC131_HASCHANNELGROUPS 1
#define DPPIC131_CH_NUM 8
#define DPPIC131_GROUP_NUM 2

#define DPPIC132_HASCHANNELGROUPS 1
#define DPPIC132_CH_NUM 8
#define DPPIC132_GROUP_NUM 2

#define DPPIC133_HASCHANNELGROUPS 1
#define DPPIC133_CH_NUM 8
#define DPPIC133_GROUP_NUM 2

