ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
#define DPPIC134_HASCHANNELGROUPS 1
#define DPPIC134_CH_NUM 8
#define DPPIC134_GROUP_NUM 2

#define DPPIC135_HASCHANNELGROUPS 1
#define DPPIC135_CH_NUM 8
#define DPPIC135_GROUP_NUM 2

#define DPPIC136_HASCHANNELGROUPS 1
#define DPPIC136_CH_NUM 8
#define DPPIC136_GROUP_NUM 2

/*AUXPM*/
#define AUXPM_PRESENT
#define AUXPM_COUNT 1

/*OTP controller*/
#define OTPC_PRESENT
#define OTPC_COUNT 1

#define OTPC_REGION_NO_EXTENSION 0
#define OTPC_REGION_EXTENSION 1
#define OTPC_NREGIONS 6
#define OTPC_REGION0ADDR 797179904
#define OTPC_REGION0SIZE 768
#define OTPC_REGION1ADDR 797180672
#define OTPC_REGION1SIZE 256
#define OTPC_REGION2ADDR 797180928
#define OTPC_REGION2SIZE 768
#define OTPC_REGION3ADDR 797181696
#define OTPC_REGION3SIZE 768
#define OTPC_REGION4ADDR 797182464
#define OTPC_REGION4SIZE 512
#define OTPC_REGION5ADDR 797182976
#define OTPC_REGION5SIZE 13312

/*VPR peripheral registers*/
#define VPR_PRESENT
#define VPR_COUNT 3

#define VPR120_INIT_PC_RESET_VALUE 796917760
#define VPR120_VPR_START_RESET_VALUE 1
#define VPR120_RAM_BASE_ADDR 797442048
#define VPR120_RAM_SZ 16
#define VPR120_VPRSAVEDCTX MEMCONF120.POWER.MEM[22]
#define VPR120_VPRSAVEADDR 797442048
#define VPR120_VPRREMAPADDRVTOB 797179904
#define VPR120_VEVIF_NTASKS 32
#define VPR120_VEVIF_NDPPI 4
#define VPR120_VEVIF_NEVENTS 4
#define VPR120_DEBUGGER_OFFSET 1024

#define VPR121_INIT_PC_RESET_VALUE 0
#define VPR121_VPR_START_RESET_VALUE 0
#define VPR121_RAM_BASE_ADDR 797507584
#define VPR121_RAM_SZ 15
#define VPR121_VPRSAVEDCTX MEMCONF120.POWER.MEM[23]
#define VPR121_VPRSAVEADDR 796917760
#define VPR121_VPRREMAPADDRVTOB 0
#define VPR121_VEVIF_NTASKS 32
#define VPR121_VEVIF_NDPPI 4
#define VPR121_VEVIF_NEVENTS 4
#define VPR121_DEBUGGER_OFFSET 1024

#define VPR130_INIT_PC_RESET_VALUE 0
#define VPR130_VPR_START_RESET_VALUE 0
#define VPR130_RAM_BASE_ADDR 801112064
#define VPR130_RAM_SZ 15
#define VPR130_VPRSAVEDCTX MEMCONF130.POWER.MEM[5]
#define VPR130_VPRSAVEADDR 796917760
#define VPR130_VPRREMAPADDRVTOB 0
#define VPR130_VEVIF_NTASKS 32
#define VPR130_VEVIF_NDPPI 4
#define VPR130_VEVIF_NEVENTS 4
#define VPR130_DEBUGGER_OFFSET 1024

/*IPCT APB registers*/
#define IPCT_PRESENT
#define IPCT_COUNT 2

/*MUTEX*/
#define MUTEX_PRESENT
#define MUTEX_COUNT 2

/*I3C*/
#define I3C_PRESENT
#define I3C_COUNT 2

/*Controller Area Network*/
#define CAN_PRESENT
#define CAN_COUNT 2

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/
                                                                                                                                  
#define MVDMA_PRESENT
#define MVDMA_COUNT 1

#define MVDMA120_COMPLETED_EVENT 1
#define MVDMA120_DPPI_DISCONNECTED 1
#define MVDMA120_INSTANCE_IN_WRAPPER 1

/*RAM Controller*/
#define RAMC_PRESENT
#define RAMC_COUNT 1

#define RAMC122_ECC 0
#define RAMC122_SEC 0

/*Timer/Counter*/
#define TIMER_PRESENT
#define TIMER_COUNT 10

#define TIMER120_CC_NUM 6
#define TIMER120_MAX_SIZE 32

#define TIMER121_CC_NUM 6
#define TIMER121_MAX_SIZE 32

#define TIMER130_CC_NUM 6
#define TIMER130_MAX_SIZE 32

#define TIMER131_CC_NUM 6
#define TIMER131_MAX_SIZE 32

#define TIMER132_CC_NUM 6
#define TIMER132_MAX_SIZE 32

#define TIMER133_CC_NUM 6
#define TIMER133_MAX_SIZE 32

#define TIMER134_CC_NUM 6
#define TIMER134_MAX_SIZE 32

#define TIMER135_CC_NUM 6
#define TIMER135_MAX_SIZE 32

#define TIMER136_CC_NUM 6
#define TIMER136_MAX_SIZE 32

#define TIMER137_CC_NUM 6
#define TIMER137_MAX_SIZE 32

/*Pulse width modulation unit*/
#define PWM_PRESENT
#define PWM_COUNT 5

#define PWM120_EASYDMA5 1
#define PWM120_EASYDMATEMP 0
#define PWM120_IDLE_OUT 1
#define PWM120_COMPARE_MATCH 1
#define PWM120_FEATURES_V2 1
#define PWM120_NO_FEATURES_V2 1
#define PWM120_EASYDMALISTINCLUDED 0
#define PWM120_EASYDMAMODEINCLUDED 0
#define PWM120_EASYDMAFULLLPMODEINCLUDED 0
#define PWM120_EASYDMAPATTERNMATCHERINCLUDED 0
#define PWM120_easyDMAMatchEventRange 4
#define PWM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED
#define PWM120_EASYDMASTOPTASKINCLUDED 1

#define PWM130_EASYDMA5 1
#define PWM130_EASYDMATEMP 0
#define PWM130_IDLE_OUT 1
#define PWM130_COMPARE_MATCH 1
#define PWM130_FEATURES_V2 1
#define PWM130_NO_FEATURES_V2 1
#define PWM130_EASYDMALISTINCLUDED 0
#define PWM130_EASYDMAMODEINCLUDED 0
#define PWM130_EASYDMAFULLLPMODEINCLUDED 0
#define PWM130_EASYDMAPATTERNMATCHERINCLUDED 0
#define PWM130_easyDMAMatchEventRange 4
#define PWM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED
#define PWM130_EASYDMASTOPTASKINCLUDED 1

#define PWM131_EASYDMA5 1
#define PWM131_EASYDMATEMP 0
#define PWM131_IDLE_OUT 1
#define PWM131_COMPARE_MATCH 1
#define PWM131_FEATURES_V2 1
#define PWM131_NO_FEATURES_V2 1
#define PWM131_EASYDMALISTINCLUDED 0
#define PWM131_EASYDMAMODEINCLUDED 0
#define PWM131_EASYDMAFULLLPMODEINCLUDED 0
#define PWM131_EASYDMAPATTERNMATCHERINCLUDED 0
#define PWM131_easyDMAMatchEventRange 4
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED
#define PWM131_EASYDMASTOPTASKINCLUDED 1

#define PWM132_EASYDMA5 1
#define PWM132_EASYDMATEMP 0
#define PWM132_IDLE_OUT 1
#define PWM132_COMPARE_MATCH 1
#define PWM132_FEATURES_V2 1
#define PWM132_NO_FEATURES_V2 1
#define PWM132_EASYDMALISTINCLUDED 0
#define PWM132_EASYDMAMODEINCLUDED 0
#define PWM132_EASYDMAFULLLPMODEINCLUDED 0
#define PWM132_EASYDMAPATTERNMATCHERINCLUDED 0
#define PWM132_easyDMAMatchEventRange 4
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED
#define PWM132_EASYDMASTOPTASKINCLUDED 1

#define PWM133_EASYDMA5 1
#define PWM133_EASYDMATEMP 0
#define PWM133_IDLE_OUT 1
#define PWM133_COMPARE_MATCH 1
#define PWM133_FEATURES_V2 1
#define PWM133_NO_FEATURES_V2 1
#define PWM133_EASYDMALISTINCLUDED 0
#define PWM133_EASYDMAMODEINCLUDED 0
#define PWM133_EASYDMAFULLLPMODEINCLUDED 0
#define PWM133_EASYDMAPATTERNMATCHERINCLUDED 0
#define PWM133_easyDMAMatchEventRange 4
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED
#define PWM133_EASYDMASTOPTASKINCLUDED 1

