ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
/*SPI Slave*/
#define SPIS_PRESENT
#define SPIS_COUNT 9

#define SPIS120_LEGACYPSEL 0
#define SPIS120_LEGACYEDMA 0
#define SPIS120_EASYDMA_MAXCNT_SIZE 16
#define SPIS120_EASYDMA5 1
#define SPIS120_EASYDMATEMP 0
#define SPIS120_EASYDMALISTINCLUDED 1
#define SPIS120_EASYDMAMODEINCLUDED 0
#define SPIS120_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS120_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS120_easyDMAMatchEventRange 4
#define SPIS120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS120_EASYDMASTOPTASKINCLUDED 1

#define SPIS130_LEGACYPSEL 0
#define SPIS130_LEGACYEDMA 0
#define SPIS130_EASYDMA_MAXCNT_SIZE 16
#define SPIS130_EASYDMA5 1
#define SPIS130_EASYDMATEMP 0
#define SPIS130_EASYDMALISTINCLUDED 1
#define SPIS130_EASYDMAMODEINCLUDED 0
#define SPIS130_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS130_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS130_easyDMAMatchEventRange 4
#define SPIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS130_EASYDMASTOPTASKINCLUDED 1

#define SPIS131_LEGACYPSEL 0
#define SPIS131_LEGACYEDMA 0
#define SPIS131_EASYDMA_MAXCNT_SIZE 16
#define SPIS131_EASYDMA5 1
#define SPIS131_EASYDMATEMP 0
#define SPIS131_EASYDMALISTINCLUDED 1
#define SPIS131_EASYDMAMODEINCLUDED 0
#define SPIS131_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS131_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS131_easyDMAMatchEventRange 4
#define SPIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS131_EASYDMASTOPTASKINCLUDED 1

#define SPIS132_LEGACYPSEL 0
#define SPIS132_LEGACYEDMA 0
#define SPIS132_EASYDMA_MAXCNT_SIZE 16
#define SPIS132_EASYDMA5 1
#define SPIS132_EASYDMATEMP 0
#define SPIS132_EASYDMALISTINCLUDED 1
#define SPIS132_EASYDMAMODEINCLUDED 0
#define SPIS132_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS132_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS132_easyDMAMatchEventRange 4
#define SPIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS132_EASYDMASTOPTASKINCLUDED 1

#define SPIS133_LEGACYPSEL 0
#define SPIS133_LEGACYEDMA 0
#define SPIS133_EASYDMA_MAXCNT_SIZE 16
#define SPIS133_EASYDMA5 1
#define SPIS133_EASYDMATEMP 0
#define SPIS133_EASYDMALISTINCLUDED 1
#define SPIS133_EASYDMAMODEINCLUDED 0
#define SPIS133_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS133_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS133_easyDMAMatchEventRange 4
#define SPIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS133_EASYDMASTOPTASKINCLUDED 1

#define SPIS134_LEGACYPSEL 0
#define SPIS134_LEGACYEDMA 0
#define SPIS134_EASYDMA_MAXCNT_SIZE 16
#define SPIS134_EASYDMA5 1
#define SPIS134_EASYDMATEMP 0
#define SPIS134_EASYDMALISTINCLUDED 1
#define SPIS134_EASYDMAMODEINCLUDED 0
#define SPIS134_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS134_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS134_easyDMAMatchEventRange 4
#define SPIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS134_EASYDMASTOPTASKINCLUDED 1

#define SPIS135_LEGACYPSEL 0
#define SPIS135_LEGACYEDMA 0
#define SPIS135_EASYDMA_MAXCNT_SIZE 16
#define SPIS135_EASYDMA5 1
#define SPIS135_EASYDMATEMP 0
#define SPIS135_EASYDMALISTINCLUDED 1
#define SPIS135_EASYDMAMODEINCLUDED 0
#define SPIS135_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS135_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS135_easyDMAMatchEventRange 4
#define SPIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS135_EASYDMASTOPTASKINCLUDED 1

#define SPIS136_LEGACYPSEL 0
#define SPIS136_LEGACYEDMA 0
#define SPIS136_EASYDMA_MAXCNT_SIZE 16
#define SPIS136_EASYDMA5 1
#define SPIS136_EASYDMATEMP 0
#define SPIS136_EASYDMALISTINCLUDED 1
#define SPIS136_EASYDMAMODEINCLUDED 0
#define SPIS136_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS136_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS136_easyDMAMatchEventRange 4
#define SPIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS136_EASYDMASTOPTASKINCLUDED 1

#define SPIS137_LEGACYPSEL 0
#define SPIS137_LEGACYEDMA 0
#define SPIS137_EASYDMA_MAXCNT_SIZE 16
#define SPIS137_EASYDMA5 1
#define SPIS137_EASYDMATEMP 0
#define SPIS137_EASYDMALISTINCLUDED 1
#define SPIS137_EASYDMAMODEINCLUDED 0
#define SPIS137_EASYDMAFULLLPMODEINCLUDED 0
#define SPIS137_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIS137_easyDMAMatchEventRange 4
#define SPIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIS137_EASYDMASTOPTASKINCLUDED 1

/*Serial Peripheral Interface Master with EasyDMA*/
#define SPIM_PRESENT
#define SPIM_COUNT 12

#define SPIM120_EASYDMA5 1
#define SPIM120_EASYDMATEMP 0
#define SPIM120_EASYDMALISTINCLUDED 1
#define SPIM120_EASYDMAMODEINCLUDED 0
#define SPIM120_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM120_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM120_easyDMAMatchEventRange 4
#define SPIM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM120_EASYDMASTOPTASKINCLUDED 1
#define SPIM120_MAX_DATARATE 8
#define SPIM120_EASYDMA_MAXCNT_SIZE 16
#define SPIM120_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM120_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM120_FEATURE_RXDELAY_PRESENT 1
#define SPIM120_STALL_STATUS_PRESENT 0
#define SPIM120_STALL_STATUS_TX_PRESENT 0
#define SPIM120_HSSPI 0
#define SPIM120_HIGH_SPEED_DOMAIN 1
#define SPIM120_MULTIPLE_CHIPSELECT 1
#define SPIM120_NUM_CHIPSELECT 1
#define SPIM120_CORE_FREQUENCY 320
#define SPIM120_PRESCALER_PRESENT 1
#define SPIM120_PRESCALER_DIVISOR_RANGE 123

#define SPIM121_EASYDMA5 1
#define SPIM121_EASYDMATEMP 0
#define SPIM121_EASYDMALISTINCLUDED 1
#define SPIM121_EASYDMAMODEINCLUDED 0
#define SPIM121_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM121_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM121_easyDMAMatchEventRange 4
#define SPIM121_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM121_EASYDMASTOPTASKINCLUDED 1
#define SPIM121_MAX_DATARATE 8
#define SPIM121_EASYDMA_MAXCNT_SIZE 16
#define SPIM121_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM121_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM121_FEATURE_RXDELAY_PRESENT 1
#define SPIM121_STALL_STATUS_PRESENT 0
#define SPIM121_STALL_STATUS_TX_PRESENT 0
#define SPIM121_HSSPI 0
#define SPIM121_HIGH_SPEED_DOMAIN 1
#define SPIM121_MULTIPLE_CHIPSELECT 1
#define SPIM121_NUM_CHIPSELECT 1
#define SPIM121_CORE_FREQUENCY 320
#define SPIM121_PRESCALER_PRESENT 1
#define SPIM121_PRESCALER_DIVISOR_RANGE 123

#define SPIM122_EASYDMA5 1
#define SPIM122_EASYDMATEMP 0
#define SPIM122_EASYDMALISTINCLUDED 1
#define SPIM122_EASYDMAMODEINCLUDED 0
#define SPIM122_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM122_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM122_easyDMAMatchEventRange 4
#define SPIM122_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM122_EASYDMASTOPTASKINCLUDED 1
#define SPIM122_MAX_DATARATE 8
#define SPIM122_EASYDMA_MAXCNT_SIZE 16
#define SPIM122_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM122_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM122_FEATURE_RXDELAY_PRESENT 1
#define SPIM122_STALL_STATUS_PRESENT 0
#define SPIM122_STALL_STATUS_TX_PRESENT 0
#define SPIM122_HSSPI 0
#define SPIM122_HIGH_SPEED_DOMAIN 1
#define SPIM122_MULTIPLE_CHIPSELECT 1
#define SPIM122_NUM_CHIPSELECT 1
#define SPIM122_CORE_FREQUENCY 320
#define SPIM122_PRESCALER_PRESENT 1
#define SPIM122_PRESCALER_DIVISOR_RANGE 123

#define SPIM123_EASYDMA5 1
#define SPIM123_EASYDMATEMP 0
#define SPIM123_EASYDMALISTINCLUDED 1
#define SPIM123_EASYDMAMODEINCLUDED 0
#define SPIM123_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM123_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM123_easyDMAMatchEventRange 4
#define SPIM123_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM123_EASYDMASTOPTASKINCLUDED 1
#define SPIM123_MAX_DATARATE 8
#define SPIM123_EASYDMA_MAXCNT_SIZE 16
#define SPIM123_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM123_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM123_FEATURE_RXDELAY_PRESENT 1
#define SPIM123_STALL_STATUS_PRESENT 0
#define SPIM123_STALL_STATUS_TX_PRESENT 0
#define SPIM123_HSSPI 0
#define SPIM123_HIGH_SPEED_DOMAIN 1
#define SPIM123_MULTIPLE_CHIPSELECT 1
#define SPIM123_NUM_CHIPSELECT 1
#define SPIM123_CORE_FREQUENCY 320
#define SPIM123_PRESCALER_PRESENT 1
#define SPIM123_PRESCALER_DIVISOR_RANGE 123

