ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
#define SPIM130_EASYDMA5 1
#define SPIM130_EASYDMATEMP 0
#define SPIM130_EASYDMALISTINCLUDED 1
#define SPIM130_EASYDMAMODEINCLUDED 0
#define SPIM130_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM130_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM130_easyDMAMatchEventRange 4
#define SPIM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM130_EASYDMASTOPTASKINCLUDED 1
#define SPIM130_MAX_DATARATE 8
#define SPIM130_EASYDMA_MAXCNT_SIZE 16
#define SPIM130_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM130_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM130_FEATURE_RXDELAY_PRESENT 1
#define SPIM130_STALL_STATUS_PRESENT 0
#define SPIM130_STALL_STATUS_TX_PRESENT 0
#define SPIM130_HSSPI 0
#define SPIM130_HIGH_SPEED_DOMAIN 0
#define SPIM130_MULTIPLE_CHIPSELECT 1
#define SPIM130_NUM_CHIPSELECT 1
#define SPIM130_CORE_FREQUENCY 64
#define SPIM130_PRESCALER_PRESENT 1
#define SPIM130_PRESCALER_DIVISOR_RANGE 125

#define SPIM131_EASYDMA5 1
#define SPIM131_EASYDMATEMP 0
#define SPIM131_EASYDMALISTINCLUDED 1
#define SPIM131_EASYDMAMODEINCLUDED 0
#define SPIM131_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM131_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM131_easyDMAMatchEventRange 4
#define SPIM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM131_EASYDMASTOPTASKINCLUDED 1
#define SPIM131_MAX_DATARATE 8
#define SPIM131_EASYDMA_MAXCNT_SIZE 16
#define SPIM131_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM131_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM131_FEATURE_RXDELAY_PRESENT 1
#define SPIM131_STALL_STATUS_PRESENT 0
#define SPIM131_STALL_STATUS_TX_PRESENT 0
#define SPIM131_HSSPI 0
#define SPIM131_HIGH_SPEED_DOMAIN 0
#define SPIM131_MULTIPLE_CHIPSELECT 1
#define SPIM131_NUM_CHIPSELECT 1
#define SPIM131_CORE_FREQUENCY 64
#define SPIM131_PRESCALER_PRESENT 1
#define SPIM131_PRESCALER_DIVISOR_RANGE 125

#define SPIM132_EASYDMA5 1
#define SPIM132_EASYDMATEMP 0
#define SPIM132_EASYDMALISTINCLUDED 1
#define SPIM132_EASYDMAMODEINCLUDED 0
#define SPIM132_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM132_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM132_easyDMAMatchEventRange 4
#define SPIM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM132_EASYDMASTOPTASKINCLUDED 1
#define SPIM132_MAX_DATARATE 8
#define SPIM132_EASYDMA_MAXCNT_SIZE 16
#define SPIM132_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM132_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM132_FEATURE_RXDELAY_PRESENT 1
#define SPIM132_STALL_STATUS_PRESENT 0
#define SPIM132_STALL_STATUS_TX_PRESENT 0
#define SPIM132_HSSPI 0
#define SPIM132_HIGH_SPEED_DOMAIN 0
#define SPIM132_MULTIPLE_CHIPSELECT 1
#define SPIM132_NUM_CHIPSELECT 1
#define SPIM132_CORE_FREQUENCY 64
#define SPIM132_PRESCALER_PRESENT 1
#define SPIM132_PRESCALER_DIVISOR_RANGE 125

#define SPIM133_EASYDMA5 1
#define SPIM133_EASYDMATEMP 0
#define SPIM133_EASYDMALISTINCLUDED 1
#define SPIM133_EASYDMAMODEINCLUDED 0
#define SPIM133_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM133_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM133_easyDMAMatchEventRange 4
#define SPIM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM133_EASYDMASTOPTASKINCLUDED 1
#define SPIM133_MAX_DATARATE 8
#define SPIM133_EASYDMA_MAXCNT_SIZE 16
#define SPIM133_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM133_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM133_FEATURE_RXDELAY_PRESENT 1
#define SPIM133_STALL_STATUS_PRESENT 0
#define SPIM133_STALL_STATUS_TX_PRESENT 0
#define SPIM133_HSSPI 0
#define SPIM133_HIGH_SPEED_DOMAIN 0
#define SPIM133_MULTIPLE_CHIPSELECT 1
#define SPIM133_NUM_CHIPSELECT 1
#define SPIM133_CORE_FREQUENCY 64
#define SPIM133_PRESCALER_PRESENT 1
#define SPIM133_PRESCALER_DIVISOR_RANGE 125

#define SPIM134_EASYDMA5 1
#define SPIM134_EASYDMATEMP 0
#define SPIM134_EASYDMALISTINCLUDED 1
#define SPIM134_EASYDMAMODEINCLUDED 0
#define SPIM134_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM134_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM134_easyDMAMatchEventRange 4
#define SPIM134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM134_EASYDMASTOPTASKINCLUDED 1
#define SPIM134_MAX_DATARATE 8
#define SPIM134_EASYDMA_MAXCNT_SIZE 16
#define SPIM134_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM134_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM134_FEATURE_RXDELAY_PRESENT 1
#define SPIM134_STALL_STATUS_PRESENT 0
#define SPIM134_STALL_STATUS_TX_PRESENT 0
#define SPIM134_HSSPI 0
#define SPIM134_HIGH_SPEED_DOMAIN 0
#define SPIM134_MULTIPLE_CHIPSELECT 1
#define SPIM134_NUM_CHIPSELECT 1
#define SPIM134_CORE_FREQUENCY 64
#define SPIM134_PRESCALER_PRESENT 1
#define SPIM134_PRESCALER_DIVISOR_RANGE 125

#define SPIM135_EASYDMA5 1
#define SPIM135_EASYDMATEMP 0
#define SPIM135_EASYDMALISTINCLUDED 1
#define SPIM135_EASYDMAMODEINCLUDED 0
#define SPIM135_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM135_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM135_easyDMAMatchEventRange 4
#define SPIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM135_EASYDMASTOPTASKINCLUDED 1
#define SPIM135_MAX_DATARATE 8
#define SPIM135_EASYDMA_MAXCNT_SIZE 16
#define SPIM135_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM135_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM135_FEATURE_RXDELAY_PRESENT 1
#define SPIM135_STALL_STATUS_PRESENT 0
#define SPIM135_STALL_STATUS_TX_PRESENT 0
#define SPIM135_HSSPI 0
#define SPIM135_HIGH_SPEED_DOMAIN 0
#define SPIM135_MULTIPLE_CHIPSELECT 1
#define SPIM135_NUM_CHIPSELECT 1
#define SPIM135_CORE_FREQUENCY 64
#define SPIM135_PRESCALER_PRESENT 1
#define SPIM135_PRESCALER_DIVISOR_RANGE 125

#define SPIM136_EASYDMA5 1
#define SPIM136_EASYDMATEMP 0
#define SPIM136_EASYDMALISTINCLUDED 1
#define SPIM136_EASYDMAMODEINCLUDED 0
#define SPIM136_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM136_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM136_easyDMAMatchEventRange 4
#define SPIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM136_EASYDMASTOPTASKINCLUDED 1
#define SPIM136_MAX_DATARATE 8
#define SPIM136_EASYDMA_MAXCNT_SIZE 16
#define SPIM136_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM136_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM136_FEATURE_RXDELAY_PRESENT 1
#define SPIM136_STALL_STATUS_PRESENT 0
#define SPIM136_STALL_STATUS_TX_PRESENT 0
#define SPIM136_HSSPI 0
#define SPIM136_HIGH_SPEED_DOMAIN 0
#define SPIM136_MULTIPLE_CHIPSELECT 1
#define SPIM136_NUM_CHIPSELECT 1
#define SPIM136_CORE_FREQUENCY 64
#define SPIM136_PRESCALER_PRESENT 1
#define SPIM136_PRESCALER_DIVISOR_RANGE 125

#define SPIM137_EASYDMA5 1
#define SPIM137_EASYDMATEMP 0
#define SPIM137_EASYDMALISTINCLUDED 1
#define SPIM137_EASYDMAMODEINCLUDED 0
#define SPIM137_EASYDMAFULLLPMODEINCLUDED 0
#define SPIM137_EASYDMAPATTERNMATCHERINCLUDED 1
#define SPIM137_easyDMAMatchEventRange 4
#define SPIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define SPIM137_EASYDMASTOPTASKINCLUDED 1
#define SPIM137_MAX_DATARATE 8
#define SPIM137_EASYDMA_MAXCNT_SIZE 16
#define SPIM137_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM137_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM137_FEATURE_RXDELAY_PRESENT 1
#define SPIM137_STALL_STATUS_PRESENT 0
#define SPIM137_STALL_STATUS_TX_PRESENT 0
#define SPIM137_HSSPI 0
#define SPIM137_HIGH_SPEED_DOMAIN 0
#define SPIM137_MULTIPLE_CHIPSELECT 1
#define SPIM137_NUM_CHIPSELECT 1
#define SPIM137_CORE_FREQUENCY 64
#define SPIM137_PRESCALER_PRESENT 1
#define SPIM137_PRESCALER_DIVISOR_RANGE 125

/*UART with EasyDMA*/
#define UARTE_PRESENT
#define UARTE_COUNT 9

