ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
#define UARTE120_EASYDMA_MAXCNT_SIZE 8
#define UARTE120_EASYDMA5 1
#define UARTE120_EASYDMATEMP 0
#define UARTE120_TIMEOUT_INTERRUPT 1
#define UARTE120_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE120_CORE_CLOCK_16 0
#define UARTE120_CORE_CLOCK_320 1
#define UARTE120_EASYDMALISTINCLUDED 0
#define UARTE120_EASYDMAMODEINCLUDED 0
#define UARTE120_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE120_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE120_easyDMAMatchEventRange 4
#define UARTE120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE120_EASYDMASTOPTASKINCLUDED 1

#define UARTE130_EASYDMA_MAXCNT_SIZE 8
#define UARTE130_EASYDMA5 1
#define UARTE130_EASYDMATEMP 0
#define UARTE130_TIMEOUT_INTERRUPT 1
#define UARTE130_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE130_CORE_CLOCK_16 1
#define UARTE130_CORE_CLOCK_320 0
#define UARTE130_EASYDMALISTINCLUDED 0
#define UARTE130_EASYDMAMODEINCLUDED 0
#define UARTE130_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE130_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE130_easyDMAMatchEventRange 4
#define UARTE130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE130_EASYDMASTOPTASKINCLUDED 1

#define UARTE131_EASYDMA_MAXCNT_SIZE 8
#define UARTE131_EASYDMA5 1
#define UARTE131_EASYDMATEMP 0
#define UARTE131_TIMEOUT_INTERRUPT 1
#define UARTE131_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE131_CORE_CLOCK_16 1
#define UARTE131_CORE_CLOCK_320 0
#define UARTE131_EASYDMALISTINCLUDED 0
#define UARTE131_EASYDMAMODEINCLUDED 0
#define UARTE131_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE131_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE131_easyDMAMatchEventRange 4
#define UARTE131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE131_EASYDMASTOPTASKINCLUDED 1

#define UARTE132_EASYDMA_MAXCNT_SIZE 8
#define UARTE132_EASYDMA5 1
#define UARTE132_EASYDMATEMP 0
#define UARTE132_TIMEOUT_INTERRUPT 1
#define UARTE132_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE132_CORE_CLOCK_16 1
#define UARTE132_CORE_CLOCK_320 0
#define UARTE132_EASYDMALISTINCLUDED 0
#define UARTE132_EASYDMAMODEINCLUDED 0
#define UARTE132_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE132_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE132_easyDMAMatchEventRange 4
#define UARTE132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE132_EASYDMASTOPTASKINCLUDED 1

#define UARTE133_EASYDMA_MAXCNT_SIZE 8
#define UARTE133_EASYDMA5 1
#define UARTE133_EASYDMATEMP 0
#define UARTE133_TIMEOUT_INTERRUPT 1
#define UARTE133_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE133_CORE_CLOCK_16 1
#define UARTE133_CORE_CLOCK_320 0
#define UARTE133_EASYDMALISTINCLUDED 0
#define UARTE133_EASYDMAMODEINCLUDED 0
#define UARTE133_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE133_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE133_easyDMAMatchEventRange 4
#define UARTE133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE133_EASYDMASTOPTASKINCLUDED 1

#define UARTE134_EASYDMA_MAXCNT_SIZE 8
#define UARTE134_EASYDMA5 1
#define UARTE134_EASYDMATEMP 0
#define UARTE134_TIMEOUT_INTERRUPT 1
#define UARTE134_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE134_CORE_CLOCK_16 1
#define UARTE134_CORE_CLOCK_320 0
#define UARTE134_EASYDMALISTINCLUDED 0
#define UARTE134_EASYDMAMODEINCLUDED 0
#define UARTE134_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE134_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE134_easyDMAMatchEventRange 4
#define UARTE134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE134_EASYDMASTOPTASKINCLUDED 1

#define UARTE135_EASYDMA_MAXCNT_SIZE 8
#define UARTE135_EASYDMA5 1
#define UARTE135_EASYDMATEMP 0
#define UARTE135_TIMEOUT_INTERRUPT 1
#define UARTE135_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE135_CORE_CLOCK_16 1
#define UARTE135_CORE_CLOCK_320 0
#define UARTE135_EASYDMALISTINCLUDED 0
#define UARTE135_EASYDMAMODEINCLUDED 0
#define UARTE135_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE135_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE135_easyDMAMatchEventRange 4
#define UARTE135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE135_EASYDMASTOPTASKINCLUDED 1

#define UARTE136_EASYDMA_MAXCNT_SIZE 8
#define UARTE136_EASYDMA5 1
#define UARTE136_EASYDMATEMP 0
#define UARTE136_TIMEOUT_INTERRUPT 1
#define UARTE136_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE136_CORE_CLOCK_16 1
#define UARTE136_CORE_CLOCK_320 0
#define UARTE136_EASYDMALISTINCLUDED 0
#define UARTE136_EASYDMAMODEINCLUDED 0
#define UARTE136_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE136_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE136_easyDMAMatchEventRange 4
#define UARTE136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE136_EASYDMASTOPTASKINCLUDED 1

#define UARTE137_EASYDMA_MAXCNT_SIZE 8
#define UARTE137_EASYDMA5 1
#define UARTE137_EASYDMATEMP 0
#define UARTE137_TIMEOUT_INTERRUPT 1
#define UARTE137_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE137_CORE_CLOCK_16 1
#define UARTE137_CORE_CLOCK_320 0
#define UARTE137_EASYDMALISTINCLUDED 0
#define UARTE137_EASYDMAMODEINCLUDED 0
#define UARTE137_EASYDMAFULLLPMODEINCLUDED 0
#define UARTE137_EASYDMAPATTERNMATCHERINCLUDED 1
#define UARTE137_easyDMAMatchEventRange 4
#define UARTE137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define UARTE137_EASYDMASTOPTASKINCLUDED 1

/*Coexistence controller*/
#define COEXC_PRESENT
#define COEXC_COUNT 1

#define COEXC_NCLIENTS 16
#define COEXC_NMODES 8
#define COEXC_NCCMALLOWMODES 2
#define COEXC_NPRIORITYBITS 16

/*Antenna switch controller*/
#define ANTSWC_PRESENT
#define ANTSWC_COUNT 1

#define ANTSWC_NRADIOS 6
#define ANTSWC_NANTSWBITS 3

/*Real-time counter*/
#define RTC_PRESENT
#define RTC_COUNT 2

#define RTC130_CC_NUM 4

#define RTC131_CC_NUM 4

/*Watchdog Timer*/
#define WDT_PRESENT
#define WDT_COUNT 2

#define WDT131_START_ON_RESET 0
#define WDT131_CRV_RESETVALUE 4294967295
#define WDT131_ALLOW_STOP 0

#define WDT132_START_ON_RESET 0
#define WDT132_CRV_RESETVALUE 4294967295
#define WDT132_ALLOW_STOP 0

/*Event generator unit*/
#define EGU_PRESENT
#define EGU_COUNT 1

#define EGU130_PEND 0
#define EGU130_CH_NUM 8

/*GPIO Port*/
#define GPIO_PRESENT
#define GPIO_COUNT 16

#define P0_PIN_NUM 32
#define P0_PINS_PRESENT 0xFFFFFFFFUL
#define P0_DRIVECTRL 0
#define P0_PWRCTRL 0
#define P0_PWRCTRL_SEPARATE_REG 1
#define P0_VSS_FLOAT_DFT 1
#define P0_PIN_OWNER_SEC 1

#define P1_PIN_NUM 32
#define P1_PINS_PRESENT 0xFFFFFFFFUL
#define P1_DRIVECTRL 0
#define P1_PWRCTRL 0
#define P1_PWRCTRL_SEPARATE_REG 1
#define P1_VSS_FLOAT_DFT 1
#define P1_PIN_OWNER_SEC 1

#define P2_PIN_NUM 32
#define P2_PINS_PRESENT 0xFFFFFFFFUL
#define P2_DRIVECTRL 0
#define P2_PWRCTRL 0
#define P2_PWRCTRL_SEPARATE_REG 1
#define P2_VSS_FLOAT_DFT 1
#define P2_PIN_OWNER_SEC 1

#define P3_PIN_NUM 32
#define P3_PINS_PRESENT 0xFFFFFFFFUL
#define P3_DRIVECTRL 0
#define P3_PWRCTRL 0
#define P3_PWRCTRL_SEPARATE_REG 1
#define P3_VSS_FLOAT_DFT 1
#define P3_PIN_OWNER_SEC 1

#define P4_PIN_NUM 32
#define P4_PINS_PRESENT 0xFFFFFFFFUL
#define P4_DRIVECTRL 0
#define P4_PWRCTRL 0
#define P4_PWRCTRL_SEPARATE_REG 1
#define P4_VSS_FLOAT_DFT 1
#define P4_PIN_OWNER_SEC 1

#define P5_PIN_NUM 32
#define P5_PINS_PRESENT 0xFFFFFFFFUL
#define P5_DRIVECTRL 0
#define P5_PWRCTRL 0
#define P5_PWRCTRL_SEPARATE_REG 1
#define P5_VSS_FLOAT_DFT 1
#define P5_PIN_OWNER_SEC 1

#define P6_PIN_NUM 32
#define P6_PINS_PRESENT 0xFFFFFFFFUL
#define P6_DRIVECTRL 1
#define P6_PWRCTRL 0
#define P6_PWRCTRL_SEPARATE_REG 1
#define P6_VSS_FLOAT_DFT 1
#define P6_PIN_OWNER_SEC 1

#define P7_PIN_NUM 32
#define P7_PINS_PRESENT 0xFFFFFFFFUL
#define P7_DRIVECTRL 1
#define P7_PWRCTRL 0
#define P7_PWRCTRL_SEPARATE_REG 1
#define P7_VSS_FLOAT_DFT 1
#define P7_PIN_OWNER_SEC 1

#define P8_PIN_NUM 32
#define P8_PINS_PRESENT 0xFFFFFFFFUL
#define P8_DRIVECTRL 1
#define P8_PWRCTRL 0
#define P8_PWRCTRL_SEPARATE_REG 1
#define P8_VSS_FLOAT_DFT 1
#define P8_PIN_OWNER_SEC 1

