ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics_peripherals.h
#define P9_PIN_NUM 32
#define P9_PINS_PRESENT 0xFFFFFFFFUL
#define P9_DRIVECTRL 0
#define P9_PWRCTRL 1
#define P9_PWRCTRL_SEPARATE_REG 1
#define P9_VSS_FLOAT_DFT 1
#define P9_PIN_OWNER_SEC 1

#define P10_PIN_NUM 32
#define P10_PINS_PRESENT 0xFFFFFFFFUL
#define P10_DRIVECTRL 0
#define P10_PWRCTRL 0
#define P10_PWRCTRL_SEPARATE_REG 1
#define P10_VSS_FLOAT_DFT 1
#define P10_PIN_OWNER_SEC 1

#define P11_PIN_NUM 32
#define P11_PINS_PRESENT 0xFFFFFFFFUL
#define P11_DRIVECTRL 0
#define P11_PWRCTRL 0
#define P11_PWRCTRL_SEPARATE_REG 1
#define P11_VSS_FLOAT_DFT 1
#define P11_PIN_OWNER_SEC 1

#define P12_PIN_NUM 32
#define P12_PINS_PRESENT 0xFFFFFFFFUL
#define P12_DRIVECTRL 0
#define P12_PWRCTRL 0
#define P12_PWRCTRL_SEPARATE_REG 1
#define P12_VSS_FLOAT_DFT 1
#define P12_PIN_OWNER_SEC 1

#define P13_PIN_NUM 32
#define P13_PINS_PRESENT 0xFFFFFFFFUL
#define P13_DRIVECTRL 0
#define P13_PWRCTRL 0
#define P13_PWRCTRL_SEPARATE_REG 1
#define P13_VSS_FLOAT_DFT 1
#define P13_PIN_OWNER_SEC 1

#define P14_PIN_NUM 32
#define P14_PINS_PRESENT 0xFFFFFFFFUL
#define P14_DRIVECTRL 0
#define P14_PWRCTRL 0
#define P14_PWRCTRL_SEPARATE_REG 1
#define P14_VSS_FLOAT_DFT 1
#define P14_PIN_OWNER_SEC 1

#define P15_PIN_NUM 32
#define P15_PINS_PRESENT 0xFFFFFFFFUL
#define P15_DRIVECTRL 0
#define P15_PWRCTRL 0
#define P15_PWRCTRL_SEPARATE_REG 1
#define P15_VSS_FLOAT_DFT 1
#define P15_PIN_OWNER_SEC 1

/*GPIO Internal*/
#define GPIOINTERNAL_PRESENT
#define GPIOINTERNAL_COUNT 1

/*Reset hub*/
#define RESETHUB_PRESENT
#define RESETHUB_COUNT 1

/*Analog to Digital Converter*/
#define SAADC_PRESENT
#define SAADC_COUNT 1

#define SAADC_EASYDMA5 0
#define SAADC_EASYDMATEMP 1
#define SAADC_PSEL_V2 1
#define SAADC_EASYDMALISTINCLUDED 0
#define SAADC_EASYDMAMODEINCLUDED 0
#define SAADC_EASYDMAFULLLPMODEINCLUDED 0
#define SAADC_EASYDMAPATTERNMATCHERINCLUDED 0
#define SAADC_easyDMAMatchEventRange 4
#define SAADC_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED

/*Comparator*/
#define COMP_PRESENT
#define COMP_COUNT 1

/*Low-power comparator*/
#define LPCOMP_PRESENT
#define LPCOMP_COUNT 1

/*Temperature Sensor*/
#define TEMP_PRESENT
#define TEMP_COUNT 1

/*NFC-A compatible radio NFC-A compatible radio*/
#define NFCT_PRESENT
#define NFCT_COUNT 1

#define NFCT_EASYDMA5 0
#define NFCT_EASYDMATEMP 0

/*Inter-IC Sound*/
#define I2S_PRESENT
#define I2S_COUNT 2

/*Quadrature Decoder*/
#define QDEC_PRESENT
#define QDEC_COUNT 2

#define QDEC130_LEGACYPSEL 0

#define QDEC131_LEGACYPSEL 0

/*SIM card interface*/
#define SIMIF_PRESENT
#define SIMIF_COUNT 1

/*Time division multiplexed audio interface*/
#define TDM_PRESENT
#define TDM_COUNT 1

#define TDM_EASYDMA5 1
#define TDM_EASYDMATEMP 0
#define TDM_EASYDMALISTINCLUDED 0
#define TDM_EASYDMAMODEINCLUDED 1
#define TDM_EASYDMAFULLLPMODEINCLUDED 0

/*I2C compatible Two-Wire Master Interface with EasyDMA*/
#define TWIM_PRESENT
#define TWIM_COUNT 8

#define TWIM130_EASYDMA5 1
#define TWIM130_EASYDMATEMP 0
#define TWIM130_EASYDMALISTINCLUDED 1
#define TWIM130_EASYDMAMODEINCLUDED 0
#define TWIM130_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM130_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM130_easyDMAMatchEventRange 4
#define TWIM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM130_EASYDMASTOPTASKINCLUDED 1

#define TWIM131_EASYDMA5 1
#define TWIM131_EASYDMATEMP 0
#define TWIM131_EASYDMALISTINCLUDED 1
#define TWIM131_EASYDMAMODEINCLUDED 0
#define TWIM131_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM131_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM131_easyDMAMatchEventRange 4
#define TWIM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM131_EASYDMASTOPTASKINCLUDED 1

#define TWIM132_EASYDMA5 1
#define TWIM132_EASYDMATEMP 0
#define TWIM132_EASYDMALISTINCLUDED 1
#define TWIM132_EASYDMAMODEINCLUDED 0
#define TWIM132_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM132_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM132_easyDMAMatchEventRange 4
#define TWIM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM132_EASYDMASTOPTASKINCLUDED 1

#define TWIM133_EASYDMA5 1
#define TWIM133_EASYDMATEMP 0
#define TWIM133_EASYDMALISTINCLUDED 1
#define TWIM133_EASYDMAMODEINCLUDED 0
#define TWIM133_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM133_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM133_easyDMAMatchEventRange 4
#define TWIM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM133_EASYDMASTOPTASKINCLUDED 1

#define TWIM134_EASYDMA5 1
#define TWIM134_EASYDMATEMP 0
#define TWIM134_EASYDMALISTINCLUDED 1
#define TWIM134_EASYDMAMODEINCLUDED 0
#define TWIM134_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM134_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM134_easyDMAMatchEventRange 4
#define TWIM134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM134_EASYDMASTOPTASKINCLUDED 1

#define TWIM135_EASYDMA5 1
#define TWIM135_EASYDMATEMP 0
#define TWIM135_EASYDMALISTINCLUDED 1
#define TWIM135_EASYDMAMODEINCLUDED 0
#define TWIM135_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM135_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM135_easyDMAMatchEventRange 4
#define TWIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM135_EASYDMASTOPTASKINCLUDED 1

#define TWIM136_EASYDMA5 1
#define TWIM136_EASYDMATEMP 0
#define TWIM136_EASYDMALISTINCLUDED 1
#define TWIM136_EASYDMAMODEINCLUDED 0
#define TWIM136_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM136_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM136_easyDMAMatchEventRange 4
#define TWIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM136_EASYDMASTOPTASKINCLUDED 1

#define TWIM137_EASYDMA5 1
#define TWIM137_EASYDMATEMP 0
#define TWIM137_EASYDMALISTINCLUDED 1
#define TWIM137_EASYDMAMODEINCLUDED 0
#define TWIM137_EASYDMAFULLLPMODEINCLUDED 0
#define TWIM137_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIM137_easyDMAMatchEventRange 4
#define TWIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIM137_EASYDMASTOPTASKINCLUDED 1

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT
#define TWIS_COUNT 8

#define TWIS130_EASYDMA5 1
#define TWIS130_EASYDMATEMP 0
#define TWIS130_EASYDMALISTINCLUDED 1
#define TWIS130_EASYDMAMODEINCLUDED 0
#define TWIS130_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS130_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS130_easyDMAMatchEventRange 4
#define TWIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS130_EASYDMASTOPTASKINCLUDED 1

#define TWIS131_EASYDMA5 1
#define TWIS131_EASYDMATEMP 0
#define TWIS131_EASYDMALISTINCLUDED 1
#define TWIS131_EASYDMAMODEINCLUDED 0
#define TWIS131_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS131_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS131_easyDMAMatchEventRange 4
#define TWIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS131_EASYDMASTOPTASKINCLUDED 1

#define TWIS132_EASYDMA5 1
#define TWIS132_EASYDMATEMP 0
#define TWIS132_EASYDMALISTINCLUDED 1
#define TWIS132_EASYDMAMODEINCLUDED 0
#define TWIS132_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS132_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS132_easyDMAMatchEventRange 4
#define TWIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS132_EASYDMASTOPTASKINCLUDED 1

#define TWIS133_EASYDMA5 1
#define TWIS133_EASYDMATEMP 0
#define TWIS133_EASYDMALISTINCLUDED 1
#define TWIS133_EASYDMAMODEINCLUDED 0
#define TWIS133_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS133_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS133_easyDMAMatchEventRange 4
#define TWIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS133_EASYDMASTOPTASKINCLUDED 1

#define TWIS134_EASYDMA5 1
#define TWIS134_EASYDMATEMP 0
#define TWIS134_EASYDMALISTINCLUDED 1
#define TWIS134_EASYDMAMODEINCLUDED 0
#define TWIS134_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS134_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS134_easyDMAMatchEventRange 4
#define TWIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS134_EASYDMASTOPTASKINCLUDED 1

#define TWIS135_EASYDMA5 1
#define TWIS135_EASYDMATEMP 0
#define TWIS135_EASYDMALISTINCLUDED 1
#define TWIS135_EASYDMAMODEINCLUDED 0
#define TWIS135_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS135_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS135_easyDMAMatchEventRange 4
#define TWIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS135_EASYDMASTOPTASKINCLUDED 1

#define TWIS136_EASYDMA5 1
#define TWIS136_EASYDMATEMP 0
#define TWIS136_EASYDMALISTINCLUDED 1
#define TWIS136_EASYDMAMODEINCLUDED 0
#define TWIS136_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS136_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS136_easyDMAMatchEventRange 4
#define TWIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS136_EASYDMASTOPTASKINCLUDED 1

#define TWIS137_EASYDMA5 1
#define TWIS137_EASYDMATEMP 0
#define TWIS137_EASYDMALISTINCLUDED 1
#define TWIS137_EASYDMAMODEINCLUDED 0
#define TWIS137_EASYDMAFULLLPMODEINCLUDED 0
#define TWIS137_EASYDMAPATTERNMATCHERINCLUDED 1
#define TWIS137_easyDMAMatchEventRange 4
#define TWIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0
#define TWIS137_EASYDMASTOPTASKINCLUDED 1

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT
#define PDM_COUNT 4

#define PDM130_EASYDMA5 0
#define PDM130_EASYDMATEMP 1
#define PDM130_EASYDMALISTINCLUDED 0
#define PDM130_EASYDMAMODEINCLUDED 0
#define PDM130_EASYDMAFULLLPMODEINCLUDED 0
#define PDM130_EASYDMAPATTERNMATCHERINCLUDED 0
#define PDM130_easyDMAMatchEventRange 4
#define PDM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED

#define PDM131_EASYDMA5 0
#define PDM131_EASYDMATEMP 1
#define PDM131_EASYDMALISTINCLUDED 0
#define PDM131_EASYDMAMODEINCLUDED 0
#define PDM131_EASYDMAFULLLPMODEINCLUDED 0
#define PDM131_EASYDMAPATTERNMATCHERINCLUDED 0
#define PDM131_easyDMAMatchEventRange 4
#define PDM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED

#define PDM132_EASYDMA5 0
#define PDM132_EASYDMATEMP 1
#define PDM132_EASYDMALISTINCLUDED 0
#define PDM132_EASYDMAMODEINCLUDED 0
#define PDM132_EASYDMAFULLLPMODEINCLUDED 0
#define PDM132_EASYDMAPATTERNMATCHERINCLUDED 0
#define PDM132_easyDMAMatchEventRange 4
#define PDM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED

#define PDM133_EASYDMA5 0
#define PDM133_EASYDMATEMP 1
#define PDM133_EASYDMALISTINCLUDED 0
#define PDM133_EASYDMAMODEINCLUDED 0
#define PDM133_EASYDMAFULLLPMODEINCLUDED 0
#define PDM133_EASYDMAPATTERNMATCHERINCLUDED 0
#define PDM133_easyDMAMatchEventRange 4
#define PDM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_GRAPHICS_PERIPHERALS_H */

